tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "stripe/stripe-cli"
brew "xz"
brew "awscli"
brew "bat"
brew "icu4c"
brew "buildifier"
brew "buildozer"
brew "coreutils"
brew "openldap"
brew "curl"
brew "diffutils"
brew "dotnet"
brew "folly"
brew "edencommon"
brew "exa"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "findutils"
brew "fzf"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "gsl"
brew "jq"
brew "krb5"
brew "libfaketime"
brew "libu2f-host"
brew "libxml2"
brew "libxslt"
brew "python@3.10"
brew "mackup"
brew "mas"
brew "moreutils"
brew "node-build"
brew "nodenv"
brew "pyenv"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "starship"
brew "stow"
brew "thrift"
brew "tldr"
brew "vale"
brew "watchman"
brew "wget"
brew "stripe/stripe-cli/stripe"
cask "1password"
cask "alacritty"
cask "amethyst"
cask "bartender"
cask "boop"
cask "divvy"
cask "fantastical"
cask "fig"
cask "firefox"
cask "hyper"
cask "iterm2"
cask "keepingyouawake"
cask "kitty"
cask "monitorcontrol"
cask "spotify"
